<a href="https://colab.research.google.com/github/freefunction/Python_datascience/blob/master/04_Python_Pandas_Part_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
myarray = np.random.randint(0,11,size=(6,6))
myarray.shape

(6, 6)

In [ ]:
rownames = ["student1","student2","student3","student4","student5","student6"]

In [ ]:
colnames = ["course1","course2","course3","course4","course5","course6"]

In [ ]:
df1 = pd.DataFrame(myarray, index=rownames, columns=colnames)
df1

          course1  course2  course3  course4  course5  course6
student1        3        5        9        8        2       10
student2        7        2        1        6        4        5
student3        1        7        6        8        5        1
student4        1        0        7        4        6        9
student5        0        6        0        5        1        3
student6        2        2        4        8        9        0

In [ ]:
type(df1)

pandas.core.frame.DataFrame

In [ ]:
type(df1["course1"])

pandas.core.series.Series

In [ ]:
sport = pd.Series({"student1":"football","student2":"basketball","student3":"tennis","student4":"football","student5":"basketball","student6":"football"})

In [ ]:
sex = pd.Series({"student1":"female","student2":"female","student3":"male","student4":"male","student5":"male","student6":"female"})

In [ ]:
df2 = pd.DataFrame({"sport": sport, "sex": sex})

In [ ]:
df2

               sport     sex
student1    football  female
student2  basketball  female
student3      tennis    male
student4    football    male
student5  basketball    male
student6    football  female

In [ ]:
df = pd.merge(df1,df2,left_index=True, right_index=True)
df

          course1  course2  course3  ...  course6       sport     sex
student1        3        5        9  ...       10    football  female
student2        7        2        1  ...        5  basketball  female
student3        1        7        6  ...        1      tennis    male
student4        1        0        7  ...        9    football    male
student5        0        6        0  ...        3  basketball    male
student6        2        2        4  ...        0    football  female

[6 rows x 8 columns]

In [ ]:
print(df["sport"])

student1      football
student2    basketball
student3        tennis
student4      football
student5    basketball
student6      football
Name: sport, dtype: object

In [ ]:
print(df.sport)

student1      football
student2    basketball
student3        tennis
student4      football
student5    basketball
student6      football
Name: sport, dtype: object

In [ ]:
print(df[["sport"]])

               sport
student1    football
student2  basketball
student3      tennis
student4    football
student5  basketball
student6    football

In [ ]:
print(df.keys())

Index(['course1', 'course2', 'course3', 'course4', 'course5', 'course6',
       'sport', 'sex'],
      dtype='object')

In [ ]:
print(df.columns)

Index(['course1', 'course2', 'course3', 'course4', 'course5', 'course6',
       'sport', 'sex'],
      dtype='object')

In [ ]:
print(df.index)

Index(['student1', 'student2', 'student3', 'student4', 'student5', 'student6'], dtype='object')

In [ ]:
print(df.values)

[[3 5 9 8 2 10 'football' 'female']
 [7 2 1 6 4 5 'basketball' 'female']
 [1 7 6 8 5 1 'tennis' 'male']
 [1 0 7 4 6 9 'football' 'male']
 [0 6 0 5 1 3 'basketball' 'male']
 [2 2 4 8 9 0 'football' 'female']]

In [ ]:
print("course2" in df.columns)

True

In [ ]:
print("test" in df.columns)

False

In [ ]:
print(df.iloc[:3,:7])

          course1  course2  course3  course4  course5  course6       sport
student1        3        5        9        8        2       10    football
student2        7        2        1        6        4        5  basketball
student3        1        7        6        8        5        1      tennis

In [ ]:
print(df.loc["student1":"student3","course1":"sport"])

          course1  course2  course3  course4  course5  course6       sport
student1        3        5        9        8        2       10    football
student2        7        2        1        6        4        5  basketball
student3        1        7        6        8        5        1      tennis

In [ ]:
print(df.loc[df.course2>5])

          course1  course2  course3  ...  course6       sport   sex
student3        1        7        6  ...        1      tennis  male
student5        0        6        0  ...        3  basketball  male

[2 rows x 8 columns]

In [ ]:
print(df.sort_values(["course1"], ascending=True))

          course1  course2  course3  ...  course6       sport     sex
student5        0        6        0  ...        3  basketball    male
student3        1        7        6  ...        1      tennis    male
student4        1        0        7  ...        9    football    male
student6        2        2        4  ...        0    football  female
student1        3        5        9  ...       10    football  female
student2        7        2        1  ...        5  basketball  female

[6 rows x 8 columns]

In [ ]:
#get the different summary statistics 

print("maximum: \n", df.iloc[:,:6].max(), "\n_________\n")
print("minimum: \n", df.iloc[:,:6].min(), "\n_________\n")
print("mean: \n", df.iloc[:,:6].mean(), "\n_________\n")
print("standard deviation : \n", df.iloc[:,:6].std(), "\n_________\n")

maximum:
 course1     7
course2     7
course3     9
course4     8
course5     9
course6    10
dtype: int64
_________

minimum:
 course1    0
course2    0
course3    0
course4    4
course5    1
course6    0
dtype: int64
_________

mean:
 course1    2.333333
course2    3.666667
course3    4.500000
course4    6.500000
course5    4.500000
course6    4.666667
dtype: float64
_________

standard deviation :
 course1    2.503331
course2    2.732520
course3    3.507136
course4    1.760682
course5    2.880972
course6    4.131182
dtype: float64
_________

In [ ]:
#get the frequency counts of unique values 

print("value count: \n", df.sex.value_counts(), "\n_________\n")

value count:
 male      3
female    3
Name: sex, dtype: int64
_________

In [ ]:
#describe 

print(df.describe())

        course1   course2   course3   course4   course5    course6
count  6.000000  6.000000  6.000000  6.000000  6.000000   6.000000
mean   2.333333  3.666667  4.500000  6.500000  4.500000   4.666667
std    2.503331  2.732520  3.507136  1.760682  2.880972   4.131182
min    0.000000  0.000000  0.000000  4.000000  1.000000   0.000000
25%    1.000000  2.000000  1.750000  5.250000  2.500000   1.500000
50%    1.500000  3.500000  5.000000  7.000000  4.500000   4.000000
75%    2.750000  5.750000  6.750000  8.000000  5.750000   8.000000
max    7.000000  7.000000  9.000000  8.000000  9.000000  10.000000

In [ ]:
#Replace method
df= df.replace([0,1,2,3,4], np.nan)
df

          course1  course2  course3  ...  course6       sport     sex
student1      NaN      5.0      9.0  ...     10.0    football  female
student2      7.0      NaN      NaN  ...      5.0  basketball  female
student3      NaN      7.0      6.0  ...      NaN      tennis    male
student4      NaN      NaN      7.0  ...      9.0    football    male
student5      NaN      6.0      NaN  ...      NaN  basketball    male
student6      NaN      NaN      NaN  ...      NaN    football  female

[6 rows x 8 columns]

In [ ]:
#True for null values 
print(df.isnull())

          course1  course2  course3  course4  course5  course6  sport    sex
student1     True    False    False    False     True    False  False  False
student2    False     True     True    False     True    False  False  False
student3     True    False    False    False    False     True  False  False
student4     True     True    False     True    False    False  False  False
student5     True    False     True    False     True     True  False  False
student6     True     True     True    False    False     True  False  False

In [ ]:
#print missing values per column

print(df.isnull().sum())

course1    5
course2    3
course3    3
course4    1
course5    3
course6    3
sport      0
sex        0
dtype: int64

In [ ]:
#print total of missing values in dataframe

print(df.isnull().sum().sum())

18